Repository: eddyem/atik_control
Catalog: locale/*/*.po
Languages: ru

source: %.3f seconds till exposition ends
ru: %.3f секунд до окончания экспозиции

source: %d seconds till pause ends
ru: %d секунд до окончания паузы

source: %s CCD shutter
ru: %s затвор ПЗС

source: %s: argument needed!
ru: %s: необходим аргумент!

source: Abort with code %d
ru: Аварийное завершение с кодом %d

source: Binning should have values from 1 to %d(H) and %d(V)
ru: Биннинг должен иметь значение от 1 до %d(H) и %d(V)

source: Camera "%s" not found
ru: Камера "%s" не найдена

source: Can't close mmap'ed file
ru: Не могу закрыть mmap'нутый файл

source: Can't get settings
ru: Не могу получить настройки

source: Can't munmap
ru: Не могу munmap

source: Can't open %s for reading
ru: Не могу открыть %s для чтения

source: Can't open camera device
ru: Не могу открыть устройство камеры

source: Can't read exposed frame!
ru: Не могу считать изображение!

source: Can't save file
ru: Не могу сохранить файл

source: Can't set 8-bit mode
ru: Ошибка установки 8-битного режима

source: Can't set preview mode
ru: Ошибка установки режима предварительного просмотра

source: Can't set settings
ru: Не могу установить настройки

source: Can't setup console
ru: Не могу настроить консоль

source: Can't start long exposition!
ru: Не могу начать длинную экспозицию!

source: Can't start short exposition!
ru: Не могу начать короткую экспозицию!

source: Can't stat %s
ru: Не могу выполнить stat %s

source: Can't write %s file
ru: Не могу записать %s файл

source: Capture frame %d
ru: Захват кадра %d

source: Close
ru: Закрыть

source: Colour camera!
ru: Цветная камера! ЭТО ЖЕСТЬ!!!

source: Error when trying to set cooling temperature %g
ru: Ошибка во время установки температуры ПЗС %g

source: Error: can't set dark mode
ru: Ошибка: не могу установить режим темновых

source: File saved as '%s'
ru: Файл записан в '%s'

source: Found %d cameras, give a specific name with "--camname" option
ru: Обнаружено %d камер, укажите конкретное имя опцией "--camname"

source: Image stat:
ru: Статистика по изображению:

source: Integer out of range
ru: Целое вне допустимого диапазона

source: Mmap error for input
ru: Ошибка mmap

source: No CCD found
ru: Камер не обнаружено

source: No filename given!
ru: Не указано имя файла!

source: Open
ru: Открыть

source: Read image
ru: Считывание изображения

source: Selected camera has no shutter
ru: У выбранной камеры нет затвора

source: Set CCD temperature to %g degr.C
ru: Установка температуры ПЗС: %g градусов Цельсия

source: This camera doesn't support exposures with length more than %gs
ru: Данная камера не поддерживает экспозиции больше %gс

source: This camera has no 8-bit mode
ru: У данной камеры отсутствует 8-битный режим

source: Unknown shutter command
ru: Неизвестная команда затвора

source: Wrong argument "%s" of parameter "%s"
ru: Неправильный аргумент "%s" параметра "%s"

source: Wrong helpstring!
ru: Неправильный формат строки помощи

source: Wrong parameter: %s
ru: Неправильный параметр: %s

source: X1 and Y1 should be greater than X0 and Y0
ru: X1 и Y1 должны быть больше X0 и Y0

source: camera device name
ru: Имя устройства камеры

source: close shutter
ru: закрыть затвор

source: date/time
ru: дата/время

source: fast (8-bit) mode
ru: быстрый (8-битный) режим

source: frame X0 coordinate
ru: координата X0 (-1 - все вместе с оверсканом)

source: frame X1 coordinate
ru: координата X1 (-1 - все вместе с оверсканом)

source: frame Y0 coordinate
ru: координата Y0 (-1 - все вместе с оверсканом)

source: frame Y1 coordinate
ru: координата Y1 (-1 - все вместе с оверсканом)

source: getImage() failed
ru: ошибка getImage()

source: horizontal binning to N pixels
ru: горизонтальный биннинг в N пикселей

source: instrument name
ru: название прибора

source: make pause for N seconds between expositions
ru: пауза в N секунд между экспозициями

source: make series of N frames
ru: серия из N кадров

source: not open shutter, when exposing ("dark frames")
ru: не открывать затвор во время экспозиции ("темновые")

source: object name
ru: название объекта

source: object type (neon, object, flat etc)
ru: тип объекта (neon, object, flat и т.п.)

source: observers' names
ru: имена наблюдателей

source: observing program name
ru: название программы наблюдения

source: open shutter
ru: открыть затвор

source: preview mode
ru: режим предварительного просмотра

source: program author
ru: автор программы

source: rewrite output file if exists
ru: перезаписать выходной файл (если есть)

source: set CCD temperature to given value (degr C)
ru: установить температуру светоприемника (гр.Ц.)

source: set exposure time to given value (seconds!!!)
ru: установить время экспозиции (секунды!!!)

source: show this help
ru: показать эту справку

source: verbose level (each -V increase it)
ru: уровень сообщений (каждый -V увеличивает его)

source: vertical binning to N pixels
ru: вертикальный биннинг в N пикселей

source: warm up CCD
ru: нагрев ПЗС
